#+TITLE:DS Class Notes
#+AUTHOR:Marcus Birkenkrahe
#+SUBTITLE: Notes for CSC482/DSC205 Introduction to Advanced Data Science Spring 2022
#+STARTUP:overview hideblocks
#+OPTIONS: toc:nil num:nil ^:nil
* Change R download repo - w8s18 + 19 (7 Mar)

  Device control is quite important in all graphical program. In R,
  there are multiple functions that achieve this - look up
  ~help(dev.list)~ for the documentation, especially
  ~example(dev.list)~ (examples at the end of the help file).

  Even though the [[eXample]] is supposedly Unix-specific, it runs under
  Windows, too. ~x11~ is the windows manager. In the example, a series
  of devices is opened, used, and finally closed again.

  #+name: eXample
  #+begin_src R :exports both :session :results output
    x11()
    plot(1:10)
    x11()
    plot(rnorm(10))
    dev.set(dev.prev())
    abline(0, 1) # through the 1:10 points
    dev.set(dev.next())
    abline(h = 0, col = "gray") # for the residual plot
    dev.set(dev.prev())
    dev.off(); dev.off() #- close the two X devices
  #+end_src

  #+RESULTS:
  #+begin_example
  windows
        2
  windows
        3
  windows
        2
  windows
        3
  null device
            1
  #+end_example

